import React from 'react'
import { ZI } from '../Template'

export default function Home() {
  return (
    <>
      <div>
        <ZI
          data={{
            "word": "笋",
            "oldword": "箂",
            "strokes": "10",
            "pinyin": "sǔn",
            "radicals": "竹",
            "explanation": "笋 \n (形声。从竹,尹声。本义竹笋)\n 竹子初从土里长出的嫩芽,味鲜美,可以做菜,也叫竹笋” \n 箂,竹胎也。--《说文》。字亦作笋。\n 绚笋及蒲。--《诗·大雅·韩奕》\n 苞笋抽节。--左思《吴都赋》\n 如筴竹笋,有二月生者,有三四月生者,有五月方生者谓之晚筴。--宋·沈括《梦溪笔谈》\n 又如笋玉(喻指女人的手指);笋剥(像剥笋似地脱掉,剥光);笋枯(笋干);笋鞭(竹的地下茎);笋尖(笋的尖嫩部分);笋衣(笋壳)\n 竹的青皮 \n 敷重笋席。--《书·顾命》。郑注析竹青皮也。”\n 如竹箭之有筠也。--《礼记·\n 笋（箂）sǔn竹的嫩茎、芽，可作菜吃冬～。毛～子。\n 笋xùn 1.竹舆。\n 笋yún 1.嫩竹的青皮;蔑青。柔韧性好，可制席。参见\"笋席\"。",
          }}
        />
      </div>
    </>
  )
}